In [1]:
import pandas as pd

import mysql.connector
from sqlalchemy import create_engine

from getpass import getpass

In [2]:
password = getpass()

········

In [3]:
cnx = mysql.connector.connect(user = "root",
                             password = password,
                             host = "localhost",
                             database = "sakila")

In [4]:
cnx.is_connected()

True

In [5]:
cursor = cnx.cursor()

In [6]:
user = "root"

pw = password

db = "sakila"

engine = create_engine(f"mysql+pymysql://{user}:{pw}@localhost/{db}")

In [7]:
def rentals_month(engine, month, year):
    query = f"""SELECT rental_id, rental_date, inventory_id, customer_id, return_date, staff_id
                FROM rental
                WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};
    """
    with engine.connect() as connection:
        df =pd.read_sql(query, connection)
    
    return df

In [8]:
df1 = rentals_month(engine, 2, 2006)

In [9]:
df2 =rentals_month(engine, 5, 2005)

In [10]:
df2

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1
...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1

In [11]:
def rental_count_month(df, month, year):
    column_name = f"rentals_{month:02d}_{year}"
    rental_count_df = df.groupby('customer_id').size().reset_index(name=column_name)
    
    return rental_count_df

In [12]:
df3 = rental_count_month(df1,2, 2006)

In [13]:
df4 = rental_count_month(df2,2, 2005)

In [14]:
def compare_rentals(df1, df2):
    combined_df = pd.merge(df1, df2, on='customer_id')
    combined_df['difference'] = combined_df.iloc[:, 1] - combined_df.iloc[:, 2]
    
    return combined_df

In [15]:
compare_rentals(df3, df4)

     customer_id  rentals_02_2006  rentals_02_2005  difference
0              5                1                3          -2
1              9                1                3          -2
2             11                1                1           0
3             14                1                5          -4
4             21                1                3          -2
..           ...              ...              ...         ...
134          582                1                1           0
135          587                1                2          -1
136          590                1                1           0
137          596                1                6          -5
138          597                1                2          -1

[139 rows x 4 columns]